podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DBGMCU_STM32F030.svd.xml
<!--
Devices using this peripheral: 
      STM32F030
-->
      <peripheral>
         <?sourceFile "DBGMCU_STM32F030" ?>
         <name>DBGMCU</name>
         <description>Debug support</description>
         <groupName>DBGMCU</groupName>
         <headerStructName>DBGMCU</headerStructName>
         <baseAddress>0x40015800</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>IDCODE</name>
               <description>MCU Device ID Code Register</description>
               <addressOffset>0x0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DEV_ID</name>
                     <description>Device Identifier</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>DIV_ID</name>
                     <description>Division Identifier</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>REV_ID</name>
                     <description>Revision Identifier</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CR</name>
               <description>Debug MCU Configuration
          Register</description>
               <addressOffset>0x4</addressOffset>
               <fields>
                  <field>
                     <name>DBG_STOP</name>
                     <description>Debug Stop Mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_STANDBY</name>
                     <description>Debug Standby Mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APBLFZ</name>
               <description>APB Low Freeze Register</description>
               <addressOffset>0x8</addressOffset>
               <fields>
                  <field>
                     <name>DBG_TIMER2_STOP</name>
                     <description>Debug Timer 2 stopped when Core is
              halted</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIMER3_STOP</name>
                     <description>Debug Timer 3 stopped when Core is
              halted</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIMER6_STOP</name>
                     <description>Debug Timer 6 stopped when Core is
              halted</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIMER14_STOP</name>
                     <description>Debug Timer 14 stopped when Core is
              halted</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_RTC_STOP</name>
                     <description>Debug RTC stopped when Core is
              halted</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_WWDG_STOP</name>
                     <description>Debug Window Wachdog stopped when Core
              is halted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_IWDG_STOP</name>
                     <description>Debug Independent Wachdog stopped when
              Core is halted</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1_SMBUS_TIMEOUT</name>
                     <description>SMBUS timeout mode stopped when Core is
              halted</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APBHFZ</name>
               <description>APB High Freeze Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>DBG_TIMER1_STOP</name>
                     <description>Debug Timer 1 stopped when Core is
              halted</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIMER15_STO</name>
                     <description>Debug Timer 15 stopped when Core is
              halted</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIMER16_STO</name>
                     <description>Debug Timer 16 stopped when Core is
              halted</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBG_TIMER17_STO</name>
                     <description>Debug Timer 17 stopped when Core is
              halted</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
